{
 "class_name": "Sequential",
 "config": {
  "name": "sequential_2",
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      24,
      43
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": false,
     "name": "lstm_2_input"
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "name": "lstm_2",
     "trainable": true,
     "batch_input_shape": [
      null,
      24,
      43
     ],
     "dtype": "float32",
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "time_major": false,
     "units": 48,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": 42
      }
     },
     "recurrent_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": 43
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "class_name": "L1",
      "config": {
       "l1": 0.10000000149011612
      }
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "implementation": 2
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_4",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "GRU",
    "config": {
     "name": "gru_2",
     "trainable": true,
     "batch_input_shape": [
      null,
      24,
      43
     ],
     "dtype": "float32",
     "return_sequences": false,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "time_major": false,
     "units": 48,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": 42
      }
     },
     "recurrent_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": 43
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L2",
      "config": {
       "l2": 0.20000000298023224
      }
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "implementation": 2,
     "reset_after": true
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_5",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_2",
     "trainable": true,
     "dtype": "float32",
     "units": 24,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": 48
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   }
  ]
 },
 "keras_version": "2.8.0",
 "backend": "tensorflow"
}